export enum FarmError {
  NAME_ALREADY_USED = '400: Назва ферми вже використовується',
  COORDINATES_ALREADY_USED = '400: Координати ферми вже використовується',
  ALREADY_IN_FARM = '400: Користувач вже в фермі',
  NOT_IN_FARM = '400: Користувач не в фермі',
  OWNER = '400: Користувач є власником ферми',
  NOT_OWNER = '403: Ви не власник ферми',
  CREATE_FAILED = '500: Не вдалося створити ферму',
  EDIT_FAILED = '500: Не вдалося редагувати ферму',
  ADD_USER_FAILED = '500: Не вдалося додати користувача',
  REMOVE_USER_FAILED = '500: Не вдалося прибрати користувача',
}
