export enum PollError {
  ALREADY_COMPLETED = '400: Опитування вже завершено',
  ALREADY_VIEWED = '400: Ви уже переглянули опитування',
  NOT_OWNER = '403: Ви не власник опитування',
  CREATE_FAILED = '500: Не вдалося створити опитування',
  EDIT_FAILED = '500: Не вдалося редагувати опитування',
  COMPLETE_FAILED = '500: Не вдалося завершити опитування',
  DELETE_FAILED = '500: Не вдалося видалити опитування',
  ADD_VIEW_FAILED = '500: Не вдалося додати перегляд',
  ADD_LIKE_FAILED = '500: Не вдалося додати вподобання',
  UPDATE_LIKE_FAILED = '500: Не вдалося оновити вподобання',
  REMOVE_LIKE_FAILED = '500: Не вдалося прибрати вподобання',
}
