export enum TaskError {
  ALREADY_TAKEN = '400: Завдання вже взято',
  NOT_TAKEN = '400: Завдання не взято',
  NOT_EXECUTED = '400: Завдання не виконано',
  NOT_CUSTOMER = '403: Ви не замовник завдання',
  NOT_EXECUTOR = '403: Ви не виконавець завдання',
  CREATE_FAILED = '500: Не вдалося створити завдання',
  EDIT_FAILED = '500: Не вдалося редагувати завдання',
  TAKE_FAILED = '500: Не вдалося взяти завдання',
  UNTAKE_FAILED = '500: Не вдалося скасувати завдання',
  EXECUTE_FAILED = '500: Не вдалося виконати завдання',
  COMPLETE_FAILED = '500: Не вдалося завершити завдання',
  DELETE_FAILED = '500: Не вдалося видалити завдання',
}
