export enum OrderError {
  ALREADY_TAKEN = '400: Замовлення вже взято',
  NOT_TAKEN = '400: Замовлення не взято',
  NOT_EXECUTED = '400: Замовлення не виконано',
  NOT_CUSTOMER = '403: Ви не замовник замовлення',
  NOT_EXECUTOR = '403: Ви не виконавець замовлення',
  CREATE_FAILED = '500: Не вдалося створити замовлення',
  EDIT_FAILED = '500: Не вдалося редагувати замовлення',
  TAKE_FAILED = '500: Не вдалося взяти замовлення',
  UNTAKE_FAILED = '500: Не вдалося скасувати замовлення',
  EXECUTE_FAILED = '500: Не вдалося виконати замовлення',
  COMPLETE_FAILED = '500: Не вдалося завершити замовлення',
  DELETE_FAILED = '500: Не вдалося видалити замовлення',
}
