export enum ArticleError {
  ALREADY_VIEWED = '400: Ви уже переглянули публікацію',
  NOT_OWNER = '403: Ви не власник публікації',
  CREATE_FAILED = '500: Не вдалося створити публікацію',
  EDIT_FAILED = '500: Не вдалося редагувати публікацію',
  DELETE_FAILED = '500: Не вдалося видалити публікацію',
  ADD_VIEW_FAILED = '500: Не вдалося додати перегляд',
  ADD_LIKE_FAILED = '500: Не вдалося додати вподобання',
  UPDATE_LIKE_FAILED = '500: Не вдалося оновити вподобання',
  REMOVE_LIKE_FAILED = '500: Не вдалося прибрати вподобання',
}
